       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULE2.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PRIX          PIC 9(4)V99 VALUE 100,50.
       01 WS-TVA           PIC 9(3)V99.
       01 WS-TOTAL         PIC 9(4)V99.
       PROCEDURE DIVISION.
           COMPUTE WS-TVA = WS-PRIX * 0,20
           COMPUTE WS-TOTAL = WS-PRIX + WS-TVA
           DISPLAY "PRIX  : " WS-PRIX
           DISPLAY "TVA   : " WS-TVA
           DISPLAY "TOTAL : " WS-TOTAL
           STOP RUN.
